Tekla.Structures.DrawingInternal.EditMode
Edit mode.

Tekla.Structures.DrawingInternal.EditMode.ModelEditMode
Model edit mode.

Tekla.Structures.DrawingInternal.EditMode.DrawingEditMode
Drawing edit mode.

Tekla.Structures.DrawingInternal.EditMode.PlanEditMode
Plan edit mode.

Tekla.Structures.DrawingInternal.EditMode.LayoutEditMode
Layout edit mode.